aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/* Variable(s) ------------------------------------------------------------------------------------------------------*/

static SD_Handle_t      SD_Handle;
static SD_CardInfo_t    SD_CardInfo;
static DSTATUS          SD_Status;
static uint32_t         SD_CardRCA;
static SD_CardType_t    SD_CardType;


/* Private function(s) ----------------------------------------------------------------------------------------------*/

static bool 	        SD_IsDetected               (void);
static void             SD_DataTransferInit         (uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard);
static SD_Error_t       SD_TransmitCommand          (uint32_t Command, uint32_t Argument, int8_t ResponseType);
static SD_Error_t       SD_CmdResponse              (uint8_t SD_CMD, int8_t ResponseType);
static void             SD_GetResponse              (uint32_t* pResponse);
static SD_Error_t       CheckOCR_Response           (uint32_t Response_R1);
static void             SD_DMA_Complete             (DMA_Stream_TypeDef* pDMA_Stream);
static SD_Error_t       SD_InitializeCard           (void);

static void             SD_StartBlockTransfert      (DMA_Stream_TypeDef* pDMA, uint32_t* pBuffer, uint32_t BlockSize, uint32_t NumberOfBlocks);
static SD_Error_t       SD_WriteBlocks_DMA          (uint64_t WriteAddress, uint32_t BlockSize, uint32_t NumberOfBlocks);
static SD_Error_t       SD_ReadBlocks_DMA           (uint64_t ReadAddress, uint32_t BlockSize, uint32_t NumberOfBlocks);
static SD_Error_t       SD_CheckOperation           (uint32_t Flag);

static SD_Error_t       SD_PowerON                  (void);
static SD_Error_t       SD_WideBusOperationConfig   (uint32_t WideMode);
static SD_Error_t       SD_FindSCR                  (uint32_t *pSCR);

//static void             SD_PowerOFF                 (void);

/** -----------------------------------------------------------------------------------------------------------------*/
/**		SD_IsDetected
  *
  * @brief  Test if card is present
  * @param  bool   true or false
  */
static bool SD_IsDetected(void)
{
    return (IO_GetInputPinValue(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) == 0);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		DataTransferInit
  *
  * @brief  Prepare the state machine for transfer
  * @param  SD_TransferType_e   TransfertDir
  * @param  SD_CARD_BlockSize_e Size
  */
static void SD_DataTransferInit(uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard)
{
    uint32_t Direction;

    SDMMC1->DTIMER = SD_DATATIMEOUT;       // Set the SDMMC Data TimeOut value
    SDMMC1->DLEN   = Size;                  // Set the SDMMC DataLength value
    Direction      = (IsItReadFromCard == true) ? SDMMC_DCTRL_DTDIR : 0;
    SDMMC1->DCTRL |=  (uint32_t)(DataBlockSize | Direction | SDMMC_DCTRL_DTEN);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		SD_TransmitCommand
  *
  * @brief  Send the commande to SDMMC
  * @param  uint32_t Command
  * @param  uint32_t Argument              Must provide the response size
  * @param  uint8_t ResponseType
  * @retval SD Card error state
  */
static SD_Error_t SD_TransmitCommand(uint32_t Command, uint32_t Argument, int8_t ResponseType)
{
    SD_Error_t ErrorState;

    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;                               // Clear the Command Flags
    SDMMC1->ARG = (uint32_t)Argument;                                   // Set the SDMMC Argument value
    SDMMC1->CMD = (uint32_t)(Command | SDMMC_CMD_CPSMEN);               // Set SDMMC command parameters
    if((Argument == 0) && (ResponseType == 0)) ResponseType = -1;       // Go idle command
    ErrorState  = SD_CmdResponse(Command & SDMMC_CMD_CMDINDEX, ResponseType);
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;                               // Clear the Command Flags

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for any response.
  *                                     - R2 (CID or CSD) response.
  *                                     - R3 (OCR) response.
  *
  * @param  SD_CMD: The sent command Index
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResponse(uint8_t SD_CMD, int8_t ResponseType)
{
    uint32_t Response_R1;
    uint32_t TimeOut;
    uint32_t Flag;

    if(ResponseType == -1) Flag = SDMMC_STA_CMDSENT;
    else                   Flag = SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT;

    TimeOut = SD_SOFTWARE_COMMAND_TIMEOUT;
    do
    {
        SD_Status = SDMMC1->STA;
        TimeOut--;
    }
    while(((SD_Status & Flag) == 0) && (TimeOut > 0));

    if(ResponseType <= 0)
    {
        if(TimeOut == 0)                            return SD_CMD_RSP_TIMEOUT;
        else                                        return SD_OK;
    }

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)     return SD_CMD_RSP_TIMEOUT;
    if(ResponseType == 3)
    {
        if(TimeOut == 0)                            return SD_CMD_RSP_TIMEOUT;  // Card is not V2.0 compliant or card does not support the set voltage range
        else                                        return SD_OK;               // Card is SD V2.0 compliant
    }

    if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)     return SD_CMD_CRC_FAIL;
    if(ResponseType == 2)                           return SD_OK;
    if((uint8_t)SDMMC1->RESPCMD != SD_CMD)          return SD_ILLEGAL_CMD;      // Check if response is of desired command

    Response_R1 = SDMMC1->RESP1;                    // We have received response, retrieve it for analysis

    if(ResponseType == 1)
    {
        return CheckOCR_Response(Response_R1);
    }
    else if(ResponseType == 6)
    {
        if((Response_R1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO)
        {
            SD_CardRCA = Response_R1;
        }
        if((Response_R1 & SD_R6_GENERAL_UNKNOWN_ERROR) == SD_R6_GENERAL_UNKNOWN_ERROR)      return SD_GENERAL_UNKNOWN_ERROR;
        if((Response_R1 & SD_R6_ILLEGAL_CMD)           == SD_R6_ILLEGAL_CMD)                return SD_ILLEGAL_CMD;
        if((Response_R1 & SD_R6_COM_CRC_FAILED)        == SD_R6_COM_CRC_FAILED)             return SD_COM_CRC_FAILED;
    }

    return SD_OK;
}


