aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Turns the SDMMC output signals off.
  * @retval SD Card error state
  */
#if 0
static void SD_PowerOFF(void)
{
   // Set Power State to OFF
   SDMMC1->POWER = (uint32_t)0;
}
#endif


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Finds the SD card SCR register value.
  * @param  pSCR: pointer to the buffer that will contain the SCR value
  * @retval SD Card error state
  */
static SD_Error_t SD_FindSCR(uint32_t *pSCR)
{
    SD_Error_t ErrorState;
    uint32_t Index = 0;
    uint32_t tempscr[2] = {0, 0};

    // Set Block Size To 8 Bytes
    // Send CMD55 APP_CMD with argument as card's RCA
    if((ErrorState = SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SD_CMD_RESPONSE_SHORT), 8, 1)) == SD_OK)
    {
        // Send CMD55 APP_CMD with argument as card's RCA
        if((ErrorState = SD_TransmitCommand((SD_CMD_APP_CMD | SD_CMD_RESPONSE_SHORT), SD_CardRCA, 1)) == SD_OK)
        {
            SD_DataTransferInit(8, SD_DATABLOCK_SIZE_8B, true);

            // Send ACMD51 SD_APP_SEND_SCR with argument as 0
            if((ErrorState = SD_TransmitCommand((SD_CMD_SD_APP_SEND_SCR | SD_CMD_RESPONSE_SHORT), 0, 1)) == SD_OK)
            {
                while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
                {
                    if((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0)
                    {
                        *(tempscr + Index) = SDMMC1->FIFO;
                        Index++;
                    }
                }

                if     ((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0) ErrorState = SD_DATA_TIMEOUT;
                else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0) ErrorState = SD_DATA_CRC_FAIL;
                else if((SDMMC1->STA & SDMMC_STA_RXOVERR)  != 0) ErrorState = SD_RX_OVERRUN;
                else if((SDMMC1->STA & SDMMC_STA_RXDAVL)   != 0) ErrorState = SD_OUT_OF_BOUND;
                else
                {
                    *(pSCR + 1) = ((tempscr[0] & SD_0TO7BITS) << 24)  | ((tempscr[0] & SD_8TO15BITS) << 8) |
                                  ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

                    *(pSCR) = ((tempscr[1] & SD_0TO7BITS) << 24)  | ((tempscr[1] & SD_8TO15BITS) << 8) |
                              ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);
                }

            }
        }
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks if the SD card is in programming state.
  * @param  pStatus: pointer to the variable that will contain the SD card state
  * @retval SD Card error state
  */
/*
static SD_Error_t SD_IsCardProgramming(uint8_t *pStatus)
{
    uint32_t Response_R1;

    SD_TransmitCommand((SD_CMD_SEND_STATUS | SDMMC_CMD_RESPONSE_SHORT), SD_CardRCA, 0);
    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)         return SD_CMD_RSP_TIMEOUT;
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)    return SD_CMD_CRC_FAIL;
    if((uint32_t)SDMMC1->RESPCMD != SD_CMD_SEND_STATUS) return SD_ILLEGAL_CMD;  // Check if is of desired command
    Response_R1 = SDMMC1->RESP1;                                                // We have received response, retrieve it for analysis
    *pStatus = (uint8_t)((Response_R1 >> 9) & 0x0000000F);                      // Find out card status

    return CheckOCR_Response(Response_R1);
}
*/

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initialize the SDMMC1 module, DMA, and IO
  */
void SD_Initialize(void)
{
    uint32_t PriorityGroup;

     // Reset SDIO Module
    RCC->APB2RSTR |=  RCC_APB2RSTR_SDMMC1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_SDMMC1RST;

    // Enable SDIO clock
    RCC->APB2ENR |= RCC_APB2ENR_SDMMC1EN;

    // Enable DMA2 clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;

	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_8,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_9,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_10,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_11,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_12,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOD,               RCC_AHB1ENR_GPIODEN, GPIO_PIN_2,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(SD_DETECT_GPIO_PORT, RCC_AHB1ENR_GPIOCEN, SD_DETECT_PIN, GPIO_MODER_INPUT,     GPIO_TYPE_PIN_PULL_UP, GPIO_OSPEEDR_LOW,       0);

    PriorityGroup = NVIC_GetPriorityGrouping();

    // NVIC configuration for SDIO interrupts
    NVIC_SetPriority(SDMMC1_IRQn, NVIC_EncodePriority(PriorityGroup, 5, 0));
    NVIC_EnableIRQ(SDMMC1_IRQn);

    // Initialize DMA2 channel 3 for RX from SD CARD
    DMA2_Stream3->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream3->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->LIFCR        = IFCR_CLEAR_MASK_STREAM3;                           // Clear all interrupt flags
    DMA2_Stream3->CR   = (DMA_CHANNEL_4        | DMA_SxCR_PFCTRL        |   // Prepare the DMA Stream configuration
                          DMA_MINC_ENABLE      | DMA_PDATAALIGN_WORD    |   // And write to DMA Stream CR register
                          DMA_MDATAALIGN_WORD  | DMA_PRIORITY_VERY_HIGH |
                          DMA_MBURST_INC4      | DMA_PBURST_INC4);

    DMA2_Stream3->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // Initialize DMA2 channel 6 for TX to SD CARD
    DMA2_Stream6->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream6->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->HIFCR        = IFCR_CLEAR_MASK_STREAM6;                           // Clear all interrupt flags
    DMA2_Stream6->CR   = (DMA_CHANNEL_4        | DMA_SxCR_PFCTRL        |   // Prepare the DMA Stream configuration
                          DMA_MINC_ENABLE      | DMA_PDATAALIGN_WORD    |   // And write to DMA Stream CR register
                          DMA_MDATAALIGN_WORD  | DMA_PRIORITY_VERY_HIGH |
                          DMA_MBURST_INC4      | DMA_PBURST_INC4        |
                          DMA_MEMORY_TO_PERIPH);
    DMA2_Stream6->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // NVIC configuration for DMA transfer complete interrupt
    NVIC_SetPriority(DMA2_Stream3_IRQn, NVIC_EncodePriority(PriorityGroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream3_IRQn);

