aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    NVIC_SetPriority(DMA2_Stream6_IRQn, NVIC_EncodePriority(PriorityGroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream6_IRQn);
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_status(void)
{
	// Check SDCARD status
	if(SD_GetStatus() == SD_OK) SD_Status &= ~STA_NOINIT;
	else                        SD_Status  =  STA_NOINIT;

	return SD_Status;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_initialize(void)
{
	SD_Error_t ErrorState;

	// Check if SD card is present
	if(SD_IsDetected() != SD_PRESENT)
    {
        return STA_NOINIT;
    }

    // Initialize SDMMC peripheral interface with default configuration for SD card initialization
    SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
    SDMMC1->CLKCR |=  (uint32_t)SDMMC_INIT_CLK_DIV;

    if((ErrorState = SD_PowerON()) == SD_OK)                    // Identify card operating voltage
    {
        if((ErrorState = SD_InitializeCard()) == SD_OK)         // Initialize the present card and put them in idle state
        {
            if((ErrorState = SD_GetCardInfo()) == SD_OK)        // Read CSD/CID MSD registers
            {
                // Select the Card - Send CMD7 SDMMC_SEL_DESEL_CARD
                ErrorState = SD_TransmitCommand((SD_CMD_SEL_DESEL_CARD | SD_CMD_RESPONSE_SHORT), SD_CardRCA, 1);
                SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;   // Configure SDMMC peripheral interface
            }
        }
    }

	// Configure SD Bus width
	if(ErrorState == SD_OK)
	{
		// Enable wide operation
		ErrorState = SD_WideBusOperationConfig(SD_BUS_WIDE_4B);
	}

	// Configure the SDCARD device
	if(ErrorState == SD_OK) SD_Status &= ~STA_NOINIT;
    else                    SD_Status  =  STA_NOINIT;

    return SD_Status;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_read(BYTE *pBuffer, DWORD Sector, UINT Count)
{
	// Prepare the DMA Transfer
    SD_StartBlockTransfert(DMA2_Stream3, (uint32_t *)pBuffer, BLOCK_SIZE, Count);

    // Read block(s) in DMA transfer mode
    if(SD_ReadBlocks_DMA((uint64_t)(Sector * BLOCK_SIZE), BLOCK_SIZE, Count) == SD_OK)
    {
        // Wait until transfer is complete
        if(SD_CheckOperation(SDMMC_STA_RXACT) == SD_OK)
        {
            return RES_OK;
        }
    }

	return RES_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_write(const BYTE *pBuffer, DWORD Sector, UINT Count)
{
    // Prepare the DMA Transfer
    SD_StartBlockTransfert(DMA2_Stream6, (uint32_t *)pBuffer, BLOCK_SIZE, Count);

    // Write block(s) in DMA transfer mode
    if(SD_WriteBlocks_DMA((uint64_t)(Sector * BLOCK_SIZE), BLOCK_SIZE, Count) == SD_OK)
    {
        // Wait until transfer is complete
        if(SD_CheckOperation(SDMMC_STA_TXACT) == SD_OK)
        {
            return RES_OK;
        }
    }

	return RES_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_ioctl(BYTE Control, void *pBuffer)
{
	DRESULT Result = RES_ERROR;

	// Check if init OK
	if((SD_Status & STA_NOINIT) != 0) return RES_NOTRDY;

	switch(Control)
	{
		// Make sure that no pending write process
		case CTRL_SYNC:
        {
			Result = RES_OK;
			break;
        }

		// Get number of sectors on the disk (DWORD)
		case GET_SECTOR_COUNT:
        {
			SD_GetCardInfo();
			*(DWORD *)pBuffer = SD_CardInfo.CardCapacity / BLOCK_SIZE;
			Result = RES_OK;
			break;
        }

		// Get R/W sector size (WORD)
		case GET_SECTOR_SIZE:
        {
			*(WORD *)pBuffer = BLOCK_SIZE;
			Result = RES_OK;
			break;
        }

		// Get erase block size in unit of sector (DWORD)
		case GET_BLOCK_SIZE:
        {
			*(DWORD*)pBuffer = BLOCK_SIZE;
			break;
        }

		default:
        {
			Result = RES_PARERR;
        }
	}

	return Result;
}


/** -----------------------------------------------------------------------------------------------------------------*/
FRESULT FATFS_GetDriveSize(char* pStr, FATFS_Size_t* SizeStruct)
{
	FATFS*  pFS;
    DWORD   FreeCluster;
	FRESULT Result;

    // Get volume information and free clusters of drive
    if((Result = f_getfree(pStr, &FreeCluster, &pFS)) == FR_OK)
    {
        // Get total sectors and free sectors
        SizeStruct->Total = (pFS->n_fatent - 2) * pFS->csize * 0.5;
        SizeStruct->Free = FreeCluster * pFS->csize * 0.5;
    }

    return Result;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function handles SD card interrupt request.
  */
void SDMMC1_IRQHandler(void)
{
    // Check for SDMMC interrupt flags
    if((SDMMC1->STA & SDMMC_STA_DATAEND) != 0)
    {
        SD_Handle.TransferComplete = 1;           // SD transfer is complete
        SD_Handle.TransferError    = SD_OK;       // No transfer error
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)    SD_Handle.TransferError = SD_DATA_CRC_FAIL;
    else if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)    SD_Handle.TransferError = SD_DATA_TIMEOUT;
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)     SD_Handle.TransferError = SD_RX_OVERRUN;
    else if((SDMMC1->STA & SDMMC_STA_TXUNDERR) != 0)    SD_Handle.TransferError = SD_TX_UNDERRUN;

    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // Disable all SDMMC peripheral interrupt sources
    SDMMC1->MASK &= ~(SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE | SDMMC_MASK_DATAENDIE  |
                      SDMMC_MASK_TXFIFOHEIE | SDMMC_MASK_RXFIFOHFIE | SDMMC_MASK_TXUNDERRIE |
                      SDMMC_MASK_RXOVERRIE);
}

